#include <stdio.h>

int main(){

	return 0;
}


/*
단층에 방 3개 짜리 건물로 시작하여 높고 넓은 건물을 만드는 것을 목표로 한다.
건물은 다음과 같은 성질을 가진다.
- 건물은 층을 늘릴 수도, 방을 늘리는 것도 가능하다.
- 무한히 늘릴 수 있다.
방은 다음과 같은 성질을 가진다.
- 각 방의 호수(번호)를 가진다.
- 하나의 방은 최대 4칸까지 쪼개질 수 있다.
- 한 칸에 한 사람 씩 살 수 있다.
- 각 방에는 1인 이상 살고 있어야 한다.
화면에 표시되어야 하는 정보는 다음과 같다.
- 현재 방의 숫자
- 현재 건물에 살고 있는 사람의 수
- 전체 방 보여주기 (건물 전체 View)
- 특정 방 내부 보여주기 (방 내부 View)
입력을 통해 수행되어야 하는 기능은 다음과 같다.
- 건물 확장 (층, 칸)
- View 변환 (건물 보기, 특정 방 보기)
- 방 별 칸 변환 (1~4개)
- 칸 별 사람 이름 변환
전체 정보 조회에서 방 안의 사람까지 보여주기
사는 사람 위치 검색
로그 기록
TTS(Text to Speach)

*/